let str = `
[00:00.00] 作曲 : 暗杠
[00:01.00] 作词 : 竹君
[00:17.000]编曲 : 暗杠
[00:18.000]
[00:19.200]器乐演奏：暗杠
[00:20.000]和声编写：暗杠
[00:23.000]听说白雪公主在逃跑
[00:26.510]小红帽在担心大灰狼
[00:29.810]听说疯帽喜欢爱丽丝
[00:33.270]丑小鸭会变成白天鹅
[00:36.750]听说彼得潘总长不大
[00:40.060]杰克他有竖琴和魔法
[00:43.480]听说森林里有糖果屋
[00:46.660]灰姑娘丢了心爱的玻璃鞋
[00:50.730]只有睿智的河水知道
[00:53.600]白雪是因为贪玩跑出了城堡
[00:57.590]小红帽有件抑制自己
[01:00.590]变成狼的大红袍
[01:03.990]总有一条蜿蜒在童话镇里七彩的河
[01:11.050]沾染魔法的乖张气息
[01:14.520]却又在爱里曲折
[01:17.890]川流不息扬起水花
[01:20.960]又卷入一帘时光入水
[01:24.620]让所有很久很久以前
[01:28.110]都走到幸福结局的时刻
[01:47.110]听说睡美人被埋藏
[01:50.440]小人鱼在眺望金殿堂
[01:53.910]听说阿波罗变成金乌
[01:57.220]草原有奔跑的剑齿虎
[02:00.800]听说匹诺曹总说着谎
[02:04.100]侏儒怪拥有宝石满箱
[02:07.620]听说悬崖有颗长生树
[02:10.840]红鞋子不知疲倦地在跳舞
[02:14.440]只有睿智的河水知道
[02:17.800]睡美人逃避了生活的煎熬
[02:21.400]小人鱼把阳光抹成眼影
[02:24.610]投进泡沫的怀抱
[02:27.740]总有一条蜿蜒在童话镇里七彩的河
[02:35.150]沾染魔法的乖张气息
[02:38.480]却又在爱里曲折
[02:41.960]川流不息扬起水花
[02:45.010]又卷入一帘时光入水
[02:48.650]让所有很久很久以前
[02:51.960]都走到幸福结局的时刻
[02:55.680]总有一条蜿蜒在童话镇里梦幻的河
[03:02.480]分隔了理想分隔现实
[03:05.820]又在前方的山口汇合
[03:09.310]川流不息扬起水花
[03:12.340]又卷入一帘时光入水
[03:16.030]让所有很久很久以前
[03:19.480]都走到幸福结局的时刻 又陌生
[03:25.070]啊~~啊~~啊~~啊~~`

let a = str.split('[');
let times = [];
let texts = {};
let Msecond = [];
a.splice(0,1);
a.forEach((item,index)=>{
    let arr = item.split(']');
    if(arr[1].trim() !== ''){
       times.push(arr[0]);
       texts[arr[0]] = arr[1];
    }
})

//转换成秒
times.forEach((v,i)=>{
  let T = v.match(/(.+)?\:(.+)?\.(.+)?/);
  Msecond[i] =  Math.round((+T[1]*60) + (+T[2]) + (+T[3]/1000));
})

export  const TextArr = texts;
export  const SecondArr = Msecond;
